zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_bsec.c
  * @author  MCD Application Team
  * @brief   BSEC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Cyclic Redundancy Check (BSEC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
 ===============================================================================
           ##### How to use this driver #####
 ===============================================================================
  [..]
     (+) Enable BSEC AHB clock using __HAL_RCC_BSEC_CLK_ENABLE();
     (+) Initialize BSEC

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal.h"

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @defgroup BSEC BSEC
  * @brief BSEC HAL module driver.
  * @{
  */

#ifdef HAL_BSEC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup BSEC_Private_Functions BSEC Private Functions
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup BSEC_Exported_Functions BSEC Exported Functions
  * @{
  */

/** @defgroup BSEC_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief  Initialization and Configuration functions.
  *
@verbatim
 ===============================================================================
      ##### Initialization and de-initialization functions #####
 ===============================================================================
  [..]  This section provides functions allowing to:
    (+) Initialize the BSEC according to the specified parameters
      in the BSEC_InitTypeDef and create the associated handle
    (+) DeInitialize the BSEC peripheral
    (+) Initialize the BSEC MSP (MCU Specific Package)
    (+) DeInitialize the BSEC MSP

@endverbatim
  * @{
  */

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group2 Peripheral Control functions
  *  @brief  management functions.
  *
@verbatim
 ===============================================================================
            ##### Peripheral Control functions #####
 ===============================================================================
  [..]  This section provides functions allowing to:
    (+) compute the 7, 8, 16 or 32-bit BSEC value of an 8, 16 or 32-bit data buffer
      using combination of the previous BSEC value and the new one.

     [..]  or

    (+) compute the 7, 8, 16 or 32-bit BSEC value of an 8, 16 or 32-bit data buffer
      independently of the previous BSEC value.

@endverbatim
  * @{
  */

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group3 Peripheral State functions
  *  @brief  Peripheral State functions.
  *
@verbatim
 ===============================================================================
            ##### Peripheral State functions #####
 ===============================================================================
  [..]
  This subsection permits to get in run-time the status of the peripheral.

@endverbatim
  * @}
  */

/**
  * @}
  */

/** @addtogroup BSEC_Private_Functions
  * @{
  */


/**
  * @}
  */


/* Private function prototypes -----------------------------------------------*/

/* Static functions -----------------------------------------------*/


/**
  * @brief   This function utility function reads for a  given register type in @ref BSEC_RegTypeTypeDef
  *      bit 'regBit' value of register index 'regIdx' within the same type 'regType'.
  *
  *      Example : read of bit 23 of register type BSEC_OTP_SRLOCK, register index 2
  *      ie : bit 23 of register BSEC_REG_SRLOCK2 reading
  *      is a call to _BSEC_UtilReadRegisterBit(phBsec, BSEC_REG_TYPE_SRLOCK, 2, 23, &bitValue)
  *
  *      Note : This function is a sub utility function that does not check the SAFMEM readiness,
  *      this is the caller function that should take care of that.
  *
  * @param   hBsec [in]   : BSEC handle
  * @param   regType [in] : BSEC register type : should take value from valid range @ref BSEC_RegTypeTypeDef
  * @param   regIdx [in]  : register index of the same type 'regType' concerned by bit read.
  * @param   regBit [in]  : register bit to read
  * @param   pBitValue [in/out] : Pointer to get register bit read value
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
static HAL_StatusTypeDef BSEC_UtilReadRegisterBit(BSEC_HandleTypeDef *hBsec,
                                                  BSEC_RegTypeTypeDef  regType,
                                                  uint32_t       regIdx,
                                                  uint32_t       regBit,
                                                  uint32_t        *pBitValue)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  __IO uint32_t *ptrReg = (uint32_t *)NULL;

