zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pBitValue != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Check validity of input parameters */
  if ((regIdx <= BSEC_REG_INDEX_MAX) && (regBit < 32U))
  {
    switch (regType)
    {
      case BSEC_REG_TYPE_DISTURBED :
        ptrReg = &(hBsec->Instance->BSEC_OTP_DISTURBED0)  + regIdx;
        break;

      case BSEC_REG_TYPE_ERROR :
        ptrReg = &(hBsec->Instance->BSEC_OTP_ERROR0)  + regIdx;
        break;

      case BSEC_REG_TYPE_WRLOCK :
        ptrReg = &(hBsec->Instance->BSEC_OTP_WRLOCK0)  + regIdx;
        break;

      case BSEC_REG_TYPE_SPLOCK :
        ptrReg = &(hBsec->Instance->BSEC_OTP_SPLOCK0)  + regIdx;
        break;

      case BSEC_REG_TYPE_SWLOCK :
        ptrReg = &(hBsec->Instance->BSEC_OTP_SWLOCK0)  + regIdx;
        break;

      case BSEC_REG_TYPE_SRLOCK :
        ptrReg = &(hBsec->Instance->BSEC_OTP_SRLOCK0)  + regIdx;
        break;

      default :
        /* Should normally never occur if advise for function call is followed by user */
        break;

    } /* of switch(regType) */

    *pBitValue = ((*ptrReg & ((uint32_t)1 << regBit)) >> regBit);

    retVal = HAL_OK;
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;

    *pBitValue = 0;
  }

  return (retVal);
}


/* Exported functions -----------------------------------------------*/



/**
  * @brief   This function initialize BSEC driver handle.
  *
  * @param   hBsec [in] : BSEC handle
  * @retval  None.
  ******************************************************************************
  */
void HAL_BSEC_Init(BSEC_HandleTypeDef *hBsec)
{
  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Set BSEC peripheral block base address */
  hBsec->Instance = (BSEC_TypeDef *)BSEC_BASE;

  /* Set BSEC driver state to Ready */
  hBsec->State = BSEC_STATE_READY;
}

/**
  * @brief   This function De-initialize the BSEC driver by powering down SAFMEM.
  *
  * @param   hBsec [in] : BSEC handle
  * @retval  None.
  ******************************************************************************
  */
void HAL_BSEC_DeInit(BSEC_HandleTypeDef *hBsec)
{
  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Call the BSEC_SafMemPwrDown() above for the power down phase */
  HAL_BSEC_SafMemPwrDown(hBsec);

  /* Set BSEC driver state to Idle */
  hBsec->State = BSEC_STATE_IDLE;
}

/**
  * @brief   This function powers up SAFMEM and setting correct frequency in
  *      SAFMEM (FRC).
  * @param   hBsec  [in] : BSEC handle
  * @param   safMemClkFreqRange [in/out] : Range of SAFMEM clock (FRC) should take values
  *           of type @ref BSEC_SafMemClkRangeTypeDef.
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_SafMemPwrUp(BSEC_HandleTypeDef      *hBsec,
                                       BSEC_SafMemClkRangeTypeDef   safMemClkFreqRange)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t timeoutDetected = 0;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Is BSEC driver should be at list in state BSEC_STATE_READY */
  if (hBsec->State >= BSEC_STATE_READY)
  {
    /* Update OTP_CONFIG fields BSEC_OTP_CONFIG.PWRUP=1b1' and BSEC_OTP_CONFIG.FRC[1:0] = FRC */
    /* Note : the PWRUP bit allows to power the SAFMEM : this is required only for   */
    /* operations with the SAFMEM that is read from SAFMEM or programming of OTP words */
    hBsec->Instance->BSEC_OTP_CONFIG |= (((uint32_t)BSEC_SAFMEM_ON << (uint32_t)BSEC_OTP_CONFIG_PWRUP_Pos) |
                                         (((uint32_t)safMemClkFreqRange & (uint32_t)BSEC_OTP_CONFIG_FRC) <<
                                          (uint32_t)BSEC_OTP_CONFIG_FRC_Pos));

    /* Get timer current value at start of loop */
    uint32_t timerValInit = HAL_GetTick();

    /* Poll bit 'BSEC_OTP_STATUS.PWRON' until is set with timeout             */
    /* This insure that SAFMEM is powered up and in stable state, ready for OTP Reading */
    /* from SAFMEM or OTP programming to SAFMEM                     */
    while (((hBsec->Instance->BSEC_OTP_STATUS & BSEC_OTP_STATUS_PWRON) == 0U) &&
           (timeoutDetected == 0U))
    {
      /* Sense timeout occurrence */
      if (((uint32_t)HAL_GetTick() - (uint32_t)timerValInit) >= (uint32_t)BSEC_TIMEOUT_SAFMEM_PWRUP_VAL)
      {
        timeoutDetected = 1;
      }

    } /* of while loop */

    if (timeoutDetected == 0U)
    {
      /* Notify in handle state that the SAFMEM is now powered up */
      hBsec->State = BSEC_STATE_SAFMEM_PWRUP;

      retVal = HAL_OK;
    }
    else
    {
      /* Error BSEC driver showed timeout */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_TIMEOUT;
    }

  } /* of if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver is not in ready state */
    /* Update Error description */
    hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
  * @brief   This function powers down SAFMEM when it was powered up
  *      and change BSEC state to BSEC_STATE_READY.
  *      No action and no error reported when SAFMEM was not powered up yet.
  *
  * @param   hBsec [in] : BSEC handle
  *
  * @retval  None.
  ******************************************************************************
  */
void HAL_BSEC_SafMemPwrDown(BSEC_HandleTypeDef   *hBsec)
{
  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking) */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Is SAFMEM already powered up ? */
  if (hBsec->State == BSEC_STATE_SAFMEM_PWRUP)
  {
    /* Write bit BSEC_OTP_CONFIG.PWRUP = 1b0' to power down SAFMEM */
    hBsec->Instance->BSEC_OTP_CONFIG &= ~(BSEC_OTP_CONFIG_PWRUP);

    /* Go down one level to BSEC_STATE_READY : that is all BSEC shadows accessible */
    /* bit no more SAFMEM access possible to program OTP or read OTP from SAFMEM   */
    hBsec->State = BSEC_STATE_READY;
  }
}

/**
  * @brief  This function reads for a given register type in @ref BSEC_RegTypeTypeDef
  *      bit 'regBit' value of otp fuse index 'otpWordIdx' within the same type 'regType'.
  *
  * @param   hBsec [in] : BSEC handle
  * @param   regType [in] : BSEC register type : should take value from valid range @ref BSEC_RegTypeTypeDef
  * @param   otpWordIdx [in] : otp fuse index
  * @param   pBitValue [in/out] : Pointer to get register bit read value
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************/

HAL_StatusTypeDef HAL_BSEC_ReadRegisterBit(BSEC_HandleTypeDef *hBsec,
                                           BSEC_RegTypeTypeDef  regType,
                                           uint32_t       otpWordIdx,
                                           uint32_t        *pBitValue)
{
  HAL_StatusTypeDef retVal;
  uint32_t       regIdx;
  uint32_t       regBit;

