zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
  HAL_BSEC_Div(otpWordIdx, 32, &regIdx, &regBit);

  retVal = BSEC_UtilReadRegisterBit(hBsec, regType, regIdx, regBit, pBitValue);

  return retVal;
}
/**
  * @brief   This function reads a given OTP word (32 bits) shadow register of index given in first
  *      parameter 'otpWordIdx'.
  *      The read analyze possible error status such as tampering attempt or
  *      sticky/permanent read locking.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word from which we want to read the shadow register.
  * @param   pOtpShadowVal [in/out] : pointer to get the OTP word shadow value.
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_OtpShadowRead(BSEC_HandleTypeDef *hBsec,
                                         uint32_t       otpWordIdx,
                                         uint32_t        *pOtpShadowVal)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  __IO uint32_t *ptrReg;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pOtpShadowVal != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* Is BSEC driver in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      ptrReg = &(hBsec->Instance->BSEC_OTP_DATA[0])  + otpWordIdx;
      *pOtpShadowVal = *ptrReg;

      retVal = HAL_OK;
    }
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Detail error */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This function handles a read OTP word (32 bits) operation from SAFMEM.
  *      The value when correctly read, will be returned in second parameter.
  *      If an issue occurs in the read process (SAFMEM upper OTP sticky read lock,
  *      SAFMEM powered down, tampering attempt, error in ECC or redundancy check while reading...),
  *      the corresponding error status is returned and the read value in * pOtpShadowVal should
  *      not be considered as valid.
  *      In any conditions, the corresponding OTP word shadow register will be updated by the read
  *      process (successful or not).
  *      So careful in case of necessity to hide shadow register, cleanup of the OTP shadow register
  *      is required outside of this function.
  *
  *      @note : special note on Sticky Read Lock feature in BSEC :
  *      Shadow OTP register can be individually read locked by sticky bit during BOOT (this
  *      prevent reloading from SAFMEM). When an OTP word is Sticky Read Locked (until next System Reset)
  *      then an OTP Read operation handled will lead to no update of the corresponding BSEC shadow register.
  *      In other words the only way to read the OTP word value (via BSEC shadow) is not available. The OTP word
  *      cannot be read by any mean, despite the OTP Read operation is possible.
  *
  * @param   hBsec [in] : BSEC handle
  *
  * @param   otpWordIdx [in] : OTP word we want to read from SAFMEM
  *                   (and update accordingly the corresponding OTP shadow register).
  *
  * @param   pOtpShadowVal [in/out] : pointer to get the OTP word value.
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_OtpRead(BSEC_HandleTypeDef *hBsec,
                                   uint32_t       otpWordIdx,
                                   uint32_t        *pOtpShadowVal)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  uint32_t bitValue = 0;
  uint32_t bitValueDisturbed = 0;
  uint32_t bitValueError = 0;
  uint32_t otpShadowVal = 0;
  uint32_t regVal;
  uint32_t timeoutDetected;
  uint32_t exitReq = 0;

  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pOtpShadowVal != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Check 'otpWordIdx' parameter validity */
  if (otpWordIdx > BSEC_OTP_WORD_INDEX_MAX)
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error |= (uint32_t)BSEC_ERROR_INVALID_PARAMETER;

    return (status); /* Early exit */
  }

  /* Is BSEC driver BSEC_STATE_SAFMEM_PWRUP state : that is SAFMEM is powered up ? */
  if (hBsec->State == BSEC_STATE_SAFMEM_PWRUP)
  {
    /* Polling until all eventual ongoing BSEC previous operations are finished */
    timeoutDetected = HAL_BSEC_WaitBusyClearWithTimeout(hBsec);
    if (timeoutDetected != 0U)
    {
      hBsec->Error |= (uint32_t)BSEC_ERROR_TIMEOUT;

      return (status); /* Early exit */
    }

    /* If we arrive here, there was no timeout detection ... */

    /* Is OTP Word 'otpWordIdx' Sticky Read Locked ? */
    status = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_SRLOCK, otpWordIdx, &bitValue);
    if (status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;

      return (HAL_ERROR); /* Early exit */
    }

    /* Prepare an OTP Read operation on OTP word index 'otpWordIdx'        */
    regVal = (BSEC_OTP_CONTROL_PROG_READ_VALUE << BSEC_OTP_CONTROL_PROG_Pos) |
             ((otpWordIdx & BSEC_OTP_CONTROL_ADDR) << BSEC_OTP_CONTROL_ADDR_Pos);

    /* Atomic write to register is required for read execution */
    hBsec->Instance->BSEC_OTP_CONTROL = regVal;

    /* Wait until end of BSEC OTP Read operation ... */
    timeoutDetected = HAL_BSEC_WaitBusyClearWithTimeout(hBsec);
    if (timeoutDetected != 0U)
    {
      hBsec->Error |= (uint32_t)BSEC_ERROR_TIMEOUT;

      return (HAL_ERROR); /* Early exit */
    }

    /* If we arrive here No timeout was detected ... */

    /* Check for eventual disturbed state in 'regBit' of 'regIdx' of */
    /* BSEC registers BSEC_OTP_DISTURBEDx and BSEC_OTP_ERRORx    */
    status = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_DISTURBED, otpWordIdx, &bitValueDisturbed);
    if (status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;

      return (HAL_ERROR); /* Early exit */
    }

    status = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_ERROR, otpWordIdx, &bitValueError);
    if (status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;

      return (HAL_ERROR); /* Early exit */
    }

    if (bitValueDisturbed == 1U)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DISTURBED;

      /* We will need to stop further processing and exit ... */
      exitReq = 1;
    }

    if (bitValueError == 1U)
    {
      /* Add the error with previous one in error mask if any */
      hBsec->Error |= (uint32_t)BSEC_ERROR_ECC_REDUNDANCY;

      /* We will need to stop further processing and exit ... */
      exitReq = 1;
    }

