zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
    /* If exit request from one of the two tests above, early exit */
    if (exitReq != 0U)
    {
      return (HAL_ERROR); /* Early exit */
    }

    /* If we arrive here : the OTP read operation was successful            */

    /* there was no Disturbed detected and no Error detected by BSEC          */
    /* AND the OTP word Index is not Sticky Read Locked, so we can read         */
    /* corresponding BSEC shadow registers that have been updated by OTP Read operation */
    status = HAL_BSEC_OtpShadowRead(hBsec, otpWordIdx, &otpShadowVal);
    if (status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;

      return (HAL_ERROR); /* Early exit */
    }

    /* If we arrive here BSEC Shadow Read was successful */
    /* Return read value following the read of shadow register */
    *pOtpShadowVal = otpShadowVal;

  } /* of if(hBsec->State == BSEC_STATE_SAFMEM_PWRUP) */

  else
  {
    /* Error BSEC driver and hardware is not in BSEC_STATE_SAFMEM_PWRUP state */
    /* Update Error description */
    hBsec->Error |= (uint32_t)BSEC_ERROR_SAFMEM_PWRDOWN;

    return (HAL_ERROR); /* Early exit */
  }

  return (HAL_OK);
}

/**
  * @brief   This function gets the security status of the SoC sample
  *      as given by OTP_DATA0[5:0], which is readable from BSEC_OTP_STATUS register.
  * @param   hBsec [in] : BSEC handle
  * @param   pSecStatus [in/out] : pointer to get the SoC sample security status
  *      The returned security status can take values from @ref BSEC_ChipSecurityTypeDef.
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetSecurityStatus(BSEC_HandleTypeDef *hBsec, BSEC_ChipSecurityTypeDef *pSecStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  __IO uint32_t otpStatus = 0;
  uint32_t securityMask = (BSEC_OTP_STATUS_INVALID |
                           BSEC_OTP_STATUS_FULLDBG |
                           BSEC_OTP_STATUS_SECURE);

  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pSecStatus != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* The BSEC driver should be at least in ready state */
  if (hBsec->State >= BSEC_STATE_READY)
  {
    /* Read only one time register BSEC_OTP_STATUS, keep security bits only */
    otpStatus = ((hBsec->Instance->BSEC_OTP_STATUS) & securityMask);

    /* BE CAREFUL : test order is very important !! DO NOT MODIFY ! */
    if (((otpStatus & BSEC_OTP_STATUS_INVALID) != 0U) || ((otpStatus & BSEC_OTP_STATUS_FULLDBG) != 0U))
    {
      /* OTP_INVALID bit is set : whatever the value of OTP_FULL_DBG and OTP_SECURED bits */
      /* the security state is OTP_INVALID                         */
      *pSecStatus = BSEC_INVALID_STATE;
    }
    else if ((otpStatus & BSEC_OTP_STATUS_CLOSED) != 0U)
    {
      /* FULL_DBG bit not set, this is a correct OTP_SECURED state */
      *pSecStatus = BSEC_SECURED_CLOSE_STATE;
    }
    else
    {
      /* OTP_INVALID, OTP_SECURE and OTP_FULLDBG bits are not set */
      /* This is an OTP_OPEN1 sample                */
      *pSecStatus = BSEC_SECURED_OPEN_STATE;
    }

    retVal = HAL_OK;

  } /* of if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
  * @brief   This function writes the OTP word 'otpWordIdx' with value 'otpVal'.
  *      The write affects one of the shadow registers in the range
  *      BSEC_OTP_DATA[0]..BSEC_OTP_DATA95.
  *      Error status such as OTP word shadow sticky locked write is checked.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word shadow index to be written
  * @param   otpVal [in] : Value to be written in OTP Word shadow register.
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_OtpShadowWrite(BSEC_HandleTypeDef *hBsec, uint32_t otpWordIdx, uint32_t otpVal)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  HAL_StatusTypeDef status;
  uint32_t bitValue = 0;
  __IO uint32_t *ptrReg;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      status = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_SWLOCK, otpWordIdx, &bitValue);
      if (status == HAL_OK)
      {
        if (bitValue == 0U)
        {
          /* No write locking => proceed to write */
          ptrReg = &(hBsec->Instance->BSEC_OTP_DATA[0])  + otpWordIdx;
          *ptrReg = otpVal;

          retVal = HAL_OK;
        }
        else
        {
          /* otpWordIdx is write locked */
          /* Update Error description */
          hBsec->Error |= (uint32_t)BSEC_ERROR_LOCK_WRITE;
        }
      } /* of if(status == BSEC_STATUS_OK) */
      else
      {
        retVal = status;
      }

    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This function tries to program a 32 bits value 'otpWordValReq' in
  *      OTP word 'otpWordIdx' in SAFMEM.
  *      The process is the following and can exit at any step before last step :
  *      1a-  Check if OTP word 'otpWordIdx' is not permanently programming locked, if that is the case return error
  *        BSEC_ERROR_PERM_LOCK_PROG.
  *      1b- Check if OTP word is not sticky programming locked,
  *        in that case return an error BSEC_ERROR_STICKY_LOCK_PROG.
  *      2a- The OTP word 'otpWordIdx' is read from SAFMEM before programming.
  *      2b- If OTP word is sticky read lock, an error BSEC_ERROR_LOCK_READ is returned as it
  *        is not possible to analyze if value requested to be programmed in 'otpWordValReq'
  *        is possible to be written in SAFMEM given the technology of SAFMEM.
  *        Remember : a programming changing
  *        one of the bits from the SAFMEM word or several bits from 1 -> 0 is impossible due to SAFMEM technology.
  *      3a- If step 2b exits without error,
  *        check if 'otpWordValReq' is a value possible to write given SAFMEM technology,
  *        given the current value in OTP word. If not possible return error BSEC_ERROR_PROG_VALUE_NOT_POSSIBLE.
  *      3b- If programming is possible, start programming action. Programming can show timeout if too long.
  *        In that case there is an exit with error BSEC_ERROR_TIMEOUT.
  *        If no timeout occurred, check after programming for an eventual ProgFail error.
  *
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word to program in SAFMEM.
  * @param   otpWordValReq [in] : 32 bits value requested to be programmed in SAFMEM.
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_OtpProgram(BSEC_HandleTypeDef    *hBsec,
                                      uint32_t         otpWordIdx,
                                      uint32_t         otpWordValReq)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  uint32_t permProgLockStatus = (uint32_t)BSEC_NOTLOCKED;
  uint32_t stickyLockStatus = (uint32_t)BSEC_NOTLOCKED;
  uint32_t stickyReadLockBitValue = 0;
  uint32_t otpShadowValBeforeProg = 0;
  uint32_t otpShadowValAfterProg = 0;
  __IO uint32_t otpDiffWord = 0;
  __IO uint32_t bit = 0;
  __IO uint32_t impossibleValDetected = 0;
  __IO uint32_t regVal = 0;
  uint32_t timeoutDetected;

  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),
                         BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* Check 'otpWordIdx' parameter validity */
  if (otpWordIdx > BSEC_OTP_WORD_INDEX_MAX)
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error |= (uint32_t)BSEC_ERROR_INVALID_PARAMETER;

    return (status); /* Early exit */
  }

  /* Is BSEC driver in ready state with SAFMEM powered up ? */
  if (hBsec->State == BSEC_STATE_SAFMEM_PWRUP)
  {
    /* Step 1a- Is the 'otpWordIdx' already permanent programming locked ? */
    /* If that is the case, no need to go further : return error BSEC_ERROR_PERM_LOCK_PROG */
    status = HAL_BSEC_GetOtpPermanentProgLockStatus(hBsec, otpWordIdx, &permProgLockStatus);
    if (status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;

      return (HAL_ERROR); /* Early exit */
    }

    /* If 'otpWordIdx' is permanently locked in Programming */
    /* no need to go further : detail error and exit    */
    if (permProgLockStatus == (uint32_t)BSEC_LOCKED)
    {
      /* Update Error description : permanent programming lock of that OTP word */
      hBsec->Error |= (uint32_t)BSEC_ERROR_PERM_LOCK_PROG;

      return (HAL_ERROR); /* Early exit */
    }

    /* If we arrive here, the OTP word 'otpWordIdx' is not permanently Programmed Locked */

    /* Step 1b- get sticky lock status for OTP 'otpWordIdx' */
    status = HAL_BSEC_GetOtpStickyLockStatus(hBsec, otpWordIdx, &stickyLockStatus);
    if (status != HAL_OK)
    {
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;

      return (HAL_ERROR); /* Early exit */
    }

    if (((uint32_t)stickyLockStatus & (uint32_t)BSEC_OTP_STICKY_LOCK_PROG_FUSE) != 0U)
    {
      /* Update Error description : sticky programming lock of that otp word */
      hBsec->Error |= (uint32_t)BSEC_ERROR_STICKY_LOCK_PROG;

      return (HAL_ERROR); /* Early exit */
    }

    /* If we arrive here : OTP word 'otpWordIdx' is */
    /* Not permanently programming locked NOR sticky programming locked */

    /* From there two possibilities */
    /* 1- If the OTP Word 'otpWordIdx' is NOT Sticky Read Locked and we can verify if the value  */
    /* we aim to program is possible to program, before actually programming it                  */
    /* 2- If the OTP Word 'otpWordIdx' is Sticky Read Locked we cannot verify the value aimed to */
    /* be programmed is possible we will simply attempt the programming of the target value      */

