zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
  /* The BSEC driver should be at least in ready state */
  if (hBsec->State >= BSEC_STATE_READY)
  {
    setFunctionMaskEffective = (setFunctionLockMask & maxFuncLockFieldVal);

    /* Write the mask in BSEC_OTP_LOCK */
    hBsec->Instance->BSEC_OTP_LOCK |= setFunctionMaskEffective;

    retVal = HAL_OK;

  } /* of if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
  * @brief   This function gets the functionality sticky locks status on functions in the following list :
  *      - OTP Upper OTP Read : shadow sticky load read for upper part OTP words : OTP[32..95] : those
  *      containing ST or OEM secrets.
  *      - Debug Enable Write : for debug (CoreSight) access control (global, for non invasive or invasive access in
  *      either non secure or secure privileged modes) : allows to disable or re-enable a debug access.
  *      - ROMLOCK : allows to unmap the upper 8 kBytes of ROM and sticky lock this unmap : this can be done
  *      by Sw only when the sample is SEC_OPEN.
  *      In all others states of the life cycle (OPEN1/OPEN2/SEC_FINAL/OTP_INVALID),
  *      the unmap of upper 8 kBytes of ROM is handled by Hw and cannot be overridden by Sw.
  *      - PROG_GLOBAL_OTP : Sticky lock programming of all OTPs until next system reset
  * @param   hBsec [in] : BSEC handle
  * @param   pFunctionLockMaskRead [in] : Pointer to get the Mask of functions locked
  *         can be compared with values of @ref BSEC_FuncStickyLockTypeDef to know each function that is locked
  *         currently.
  *         Note : each bit for which the feature is currently locked have value 1b1', values to 1b0'
  *         are the functions not locked.
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_FunctionGetLock(BSEC_HandleTypeDef *hBsec, uint32_t *pFunctionLockMaskRead)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t maxFuncLockFieldVal = (uint32_t)BSEC_FUNC_STICKY_LOCK_PROG_GLOBAL_OTP |
                                 (uint32_t)BSEC_FUNC_STICKY_LOCK_ROMLOCK     |
                                 (uint32_t)BSEC_FUNC_STICKY_LOCK_DENABLE_WRITE   |
                                 (uint32_t)BSEC_FUNC_STICKY_LOCK_OTP_UPPER_READ;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pFunctionLockMaskRead != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  /* The BSEC driver should be at least in ready state */
  if (hBsec->State >= BSEC_STATE_READY)
  {
    /* Read the mask from BSEC_OTP_LOCK */
    *pFunctionLockMaskRead = (hBsec->Instance->BSEC_OTP_LOCK & maxFuncLockFieldVal);

    retVal = HAL_OK;

  } /* of if(hBsec->State >= BSEC_STATE_READY) */
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Update Error description */
    hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
  * @brief   This function locks permanently the programming of OTP word in SAFMEM
  *      for 'otpWordIdx' given in parameter thanks to operation 'LOCK' (write SAFMEM : ie program )
  *      of register BSEC_OTP_CONTROL. This is a per OTP word operation.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word for which we should forbid programming in SAFMEM permanently.
  *      Such an OTP word in SAFMEM will never be allowed to be reprogrammed in the life of the SoC sample.
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_SetOtpPermanentProgLock(BSEC_HandleTypeDef *hBsec, uint32_t otpWordIdx)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  HAL_StatusTypeDef status;
  uint32_t lockStatus;
  uint32_t divVal = 0;
  uint32_t modVal = 0;
  uint32_t otpAddr;
  uint32_t otpWrData;
  uint32_t regVal;
  uint32_t timeoutDetected;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be Initialized with SAFMEM powered up */
    if (hBsec->State == BSEC_STATE_SAFMEM_PWRUP)
    {
      /* Is the 'otpWordIdx' already programming locked ? */
      status = HAL_BSEC_GetOtpPermanentProgLockStatus(hBsec, otpWordIdx, &lockStatus);
      if (status == HAL_OK)
      {
        if (lockStatus == (uint32_t)BSEC_NOTLOCKED)
        {
          /* 'otpWordIdx' is not yet programming locked */
          /* Proceed to operation BSEC_OTP_CONTROL.LOCK = 1b1' for the given 'otpWordIdx' */

          if (otpWordIdx < 32U)
          {
            /* OTP Low part otpWordIdx = (0..31) address and WrData scheme : take into account redundancy bits */
            /* Compute  divVal = otpWordIdx div 8 */
            /* and    modVal = otpWordIdx mod 8 */
            HAL_BSEC_Div(otpWordIdx, 8, &divVal, &modVal);
            otpAddr = divVal;
            otpWrData = ((uint32_t)0x3 << (2U * modVal));
          }
          else
          {
            /* OTP High part otpWordIdx = (32..95) : address and WrData scheme : take into account ECC bits*/
            /* Compute  divVal = (otpWordIdx - 32) div 16 */
            /* and    modVal = (otpWordIdx - 32) mod 16 */
            HAL_BSEC_Div((otpWordIdx - 32U), 16, &divVal, &modVal);
            otpAddr = (divVal + 0x04U);
            otpWrData = ((uint32_t)0x1 << modVal);
          }

          /* Polling until all ongoing BSEC operations are finished */
          timeoutDetected = HAL_BSEC_WaitBusyClearWithTimeout(hBsec);
          if (timeoutDetected != 0U)
          {
            hBsec->Error |= (uint32_t)BSEC_ERROR_TIMEOUT;
          }
          else
          {
            /* Program register BSEC_OTP_WRDATA with correct value depending on 'otpWordIdx' to lock */
            /* see Wildcat BSEC IP TRM rev 1.0.1 or higher for Wildcat and table BSEC_WRLOCK_ADDR_full_table.xlsx */
            hBsec->Instance->BSEC_OTP_WRDATA = otpWrData;

            /* Program operation with bit lock set on OTP bit address corresponding to 'otpWordIdx' */
            /* The ADDR field should be set to a value depending on 'otpWordIdx'          */
            /* see Wildcat BSEC IP TRM rev 1.0.1 or higher for Wildcat and table BSEC_WRLOCK_ADDR_full_table.xlsx */

