zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
            regVal = (BSEC_OTP_CONTROL_PROG_PROGRAM_VALUE << BSEC_OTP_CONTROL_PROG_Pos) |
                     BSEC_OTP_CONTROL_LOCK                         |
                     ((otpAddr & BSEC_OTP_CONTROL_ADDR) << BSEC_OTP_CONTROL_ADDR_Pos);

            /* atomic write */
            hBsec->Instance->BSEC_OTP_CONTROL = regVal;

            /* Wait until end of BSEC programming operation */
            timeoutDetected = HAL_BSEC_WaitBusyClearWithTimeout(hBsec);
            if (timeoutDetected != 0U)
            {
              hBsec->Error |= (uint32_t)BSEC_ERROR_TIMEOUT;
            }
            else
            {
              /* no timeout detected */
              /* Test programming fail indicator post programming operation */
              if ((hBsec->Instance->BSEC_OTP_STATUS & BSEC_OTP_STATUS_PROGFAIL) != 0U)
              {
                /* PROGFAIL indication : lock was not successful */
                /* Update Error description */
                hBsec->Error |= (uint32_t)BSEC_ERROR_PROG_FAIL;
              }
              else
              {
                /* No PROGFAIL indication : lock was successful */
                /* Update Error description to no error */
                retVal = HAL_OK;
              }

            } /* of else timeoutDetected */

          } /* of else timeoutDetected */

        } /* of if(lockStatus == BSEC_NOTLOCKED) */
        else
        {
          /* Update Error description */
          hBsec->Error |= (uint32_t)BSEC_ERROR_ALREADY_LOCKED;
        }

      } /* of if(status == HAL_OK) */

    } /* of if(hBsec->State == BSEC_STATE_SAFMEM_PWRUP) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_SAFMEM_PWRDOWN;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This function returns in second parameter 'pLockStatus', the information
  *      for a given OTP word index given in first parameter 'otpWordIdx',
  *      whether or not this OTP word is permanently programming locked.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word for which information on permanent programming lock is requested
  * @param   pLockStatus [in/out] : pointer to get permanent programming lock status : value of type
  *                                 @ref BSEC_LockTypeDef
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetOtpPermanentProgLockStatus(BSEC_HandleTypeDef *hBsec,
                                                         uint32_t       otpWordIdx,
                                                         uint32_t        *pLockStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  HAL_StatusTypeDef status;
  uint32_t bitValue = 0;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pLockStatus != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      status = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_WRLOCK, otpWordIdx, &bitValue);
      if (status == HAL_OK)
      {
        if (bitValue == 0U)
        {
          /* OTP word 'otpWordIdx' is not permanently write locked */
          *pLockStatus = (uint32_t)BSEC_NOTLOCKED;
        }
        else
        {
          /* OTP word 'otpWordIdx' is permanently write locked */
          *pLockStatus = (uint32_t)BSEC_LOCKED;
        }

        retVal = HAL_OK;
      }
      else
      {
        /* Update Error description */
        hBsec->Error |= (uint32_t)BSEC_ERROR_SOFT_DRIVER;
      }

    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This function sticky locks (ie until next system Reset) the OTP word of index
  *      'otpWordIdx' with a lock depending on sticky lock command parameter ('stickyLockCmd')
  *      which can take values in the list (Note : combination of several commands is possible) :
  *      - OTP programming lock command
  *      - OTP shadow register write lock command
  *      - OTP shadow register read lock command
  *      Note1 : this parameter should take values or combination (ORred) of values from @ref BSEC_OtpStickyLockTypeDef.
  *      Note2 : Sticky locking is applied even if already sticky locked for the same function and same bit
  *          No error is returned in that case and sticky lock is re-applied.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word index for which the sticky lock command is processed.
  * @param   stickyLockCmd [in] : Sticky lock command to apply : value of type @ref BSEC_OtpStickyLockTypeDef
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_SetOtpStickyLock(BSEC_HandleTypeDef *hBsec, uint32_t otpWordIdx, uint32_t stickyLockCmd)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t regIdx = 0;
  uint32_t regBit = 0;
  __IO uint32_t *ptrReg;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if ((otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX) &&
      (stickyLockCmd <= ((uint32_t)BSEC_OTP_STICKY_LOCK_PROG_FUSE |
                         (uint32_t)BSEC_OTP_STICKY_LOCK_WRITE_SHADOW  |
                         (uint32_t)BSEC_OTP_STICKY_LOCK_UPDATE_SHADOW)))
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      HAL_BSEC_Div(otpWordIdx, 32, &regIdx, &regBit);

      /* Handle one or several sticky lockings at the same time depending on 'stickyLockCmd' value */
      if ((stickyLockCmd & (uint32_t)BSEC_OTP_STICKY_LOCK_PROG_FUSE) != 0U)
      {
        /* Program to 1b1' bit 'regBit' of register BSEC_OTP_SPLOCK<regIdx> to sticky lock programming */
        /* otpWordIdx word */
        ptrReg = &(hBsec->Instance->BSEC_OTP_SPLOCK0)  + regIdx;
        *ptrReg |= ((uint32_t)1 << regBit);
      }

      if ((stickyLockCmd & (uint32_t)BSEC_OTP_STICKY_LOCK_WRITE_SHADOW) != 0U)
      {
        /* Program to 1b1' bit 'regBit' of register BSEC_OTP_SWLOCK<regIdx> to sticky lock write */
        /* otpWordIdx word shadow register */
        ptrReg = &(hBsec->Instance->BSEC_OTP_SWLOCK0)  + regIdx;
        *ptrReg |= ((uint32_t)1 << regBit);
      }

      if ((stickyLockCmd & (uint32_t)BSEC_OTP_STICKY_LOCK_UPDATE_SHADOW) != 0U)
      {
        /* Program to 1b1' bit 'regBit' of register BSEC_OTP_SRLOCK<regIdx> to sticky lock read */
        /* otpWordIdx word shadow register */
        ptrReg = &(hBsec->Instance->BSEC_OTP_SRLOCK0)  + regIdx;
        *ptrReg |= ((uint32_t)1 << regBit);
      }

      retVal = HAL_OK;

