zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This function gets OTP sticky lock status for the OTP word of index
  *      'otpWordIdx'.
  *      Each kind of sticky locking is checked for 'otpWordIdx' it can be a combination of items in the list :
  *      - OTP programming lock command
  *      - OTP shadow register write lock command
  *      - OTP shadow register read lock command
  *      Note : this parameter should take values from @ref BSEC_OtpStickyLockTypeDef.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word index for which the sticky lock command is processed.
  * @param   pStickyLockStatus [in] : Composite Sticky lock status : a combination of values from
  *         type @ref BSEC_OtpStickyLockTypeDef
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetOtpStickyLockStatus(BSEC_HandleTypeDef *hBsec,
                                                  uint32_t       otpWordIdx,
                                                  uint32_t        *pStickyLockStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t regIdx = 0;
  uint32_t regBit = 0;
  __IO uint32_t stickyLockStatus = 0;
  __IO uint32_t splock_flag = 0;
  __IO uint32_t swlock_flag = 0;
  __IO uint32_t srlock_flag = 0;
  __I uint32_t *ptrReg1;
  __I uint32_t *ptrReg2;
  __I uint32_t *ptrReg3;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pStickyLockStatus != (uint32_t*)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      HAL_BSEC_Div(otpWordIdx, 32, &regIdx, &regBit);

      /* Be careful : the lines below works because we add pointers uint32_t*    */
      /* So base address of the lock register (P,W,R) is incremented by (regIdx * 4) */
      ptrReg1 = &(hBsec->Instance->BSEC_OTP_SPLOCK0)  + regIdx;
      ptrReg2 = &(hBsec->Instance->BSEC_OTP_SWLOCK0)  + regIdx;
      ptrReg3 = &(hBsec->Instance->BSEC_OTP_SRLOCK0)  + regIdx;

      splock_flag = (* ptrReg1 & ((uint32_t)1 << regBit));
      swlock_flag = (* ptrReg2 & ((uint32_t)1 << regBit));
      srlock_flag = (* ptrReg3 & ((uint32_t)1 << regBit));

      /* Check sticky lock programming status */
      if (splock_flag != 0U)
      {
        stickyLockStatus |= (uint32_t)BSEC_OTP_STICKY_LOCK_PROG_FUSE;
      }

      /* Check sticky lock write shadow status */
      if (swlock_flag != 0U)
      {
        stickyLockStatus |= (uint32_t)BSEC_OTP_STICKY_LOCK_WRITE_SHADOW;
      }

      /* Check sticky lock read shadow status */
      if (srlock_flag != 0U)
      {
        stickyLockStatus |= (uint32_t)BSEC_OTP_STICKY_LOCK_UPDATE_SHADOW;
      }

      *pStickyLockStatus = (uint32_t)stickyLockStatus;

      retVal = HAL_OK;

    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}


/**
  * @brief   This function gets OTP error status for the OTP word of index 'otpWordIdx'.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word index
  * @param   pErrorStatus [in] : error status. 0 means no error, 1 means error
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetOtpErrorStatus(BSEC_HandleTypeDef *hBsec,
                                             uint32_t       otpWordIdx,
                                             uint32_t        *pErrorStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pStickyLockStatus != (uint32_t*)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      retVal = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_ERROR, otpWordIdx, pErrorStatus);
    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}


/**
  * @brief   This function gets OTP disturb status for the OTP word of index 'otpWordIdx'.
  * @param   hBsec [in] : BSEC handle
  * @param   otpWordIdx [in] : OTP word index
  * @param   pDisturbStatus [in] : disturb status
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetOtpDisturbStatus(BSEC_HandleTypeDef *hBsec,
                                               uint32_t       otpWordIdx,
                                               uint32_t        *pDisturbStatus)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pStickyLockStatus != (uint32_t*)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

