zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
  if (otpWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      /* Find which register index and which bit position is */
      /* corresponding to 'otpWordIdx'             */
      retVal = HAL_BSEC_ReadRegisterBit(hBsec, BSEC_REG_TYPE_DISTURBED, otpWordIdx, pDisturbStatus);
    } /* of if(hBsec->State >= BSEC_STATE_READY) */
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Update Error description */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}


/**
  * @brief   This function returns a mask of feature currently disabled in
  *           EWS stage by SAFMEM OTP_DATA1 word programming.
  * @param   hBsec [in] : BSEC handle
  * @param   pMaskFeatDisabled [in/out] : pointer to get the mask of feature currently disabled by OTP_DATA1.
  *
  *      Careful here a value 1b1' in the bitmask[i] means that the corresponding feature :
  *      (1 << BSEC_OtpFeatureStickyLockTypeDef[i]) is disabled by OTP programming and not accessible to hardware.
  *      But can be potentially re-enabled by programming BSEC_FENABLE[i] = 1b1' on a secure sample
  *      (ie BSEC_OTP_STATUS.OTP_SECURED=1b1').
  *      bitmask[i] = 1b0' means that the feature is not disabled by OTP, hence Hw accessible.
  *
  *      Note : The check of SAFMEM readiness is done by second level function.
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetFeatureDisabled(BSEC_HandleTypeDef *hBsec, uint32_t *pMaskFeatDisabled)
{
  HAL_StatusTypeDef status;
  uint32_t featureDisabledValidMask = ((1U << ((uint32_t)BSEC_FEAT_MAX + 1U)) - 1U);
  uint32_t otpShadowReadVal = 0;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pMaskFeatDisabled != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Read feature disabled from BSEC_OTP_DATA1 as always copied from SAFMEM for that word */
  /* BSEC Ready state is checked by second level function BSEC_OtpShadowRead() here     */
  status = HAL_BSEC_OtpShadowRead(hBsec, 1, (uint32_t *)&otpShadowReadVal);
  if (status == HAL_OK)
  {
    /* Mask OTP word read value with only feature disabled mask */
    otpShadowReadVal = (otpShadowReadVal & featureDisabledValidMask);

    *pMaskFeatDisabled = otpShadowReadVal;
  }

  return (status);
}

/**
  * @brief   This function returns the value of bit OTP_DATA1.fdis_tk that gives information of ST Key Provisioning
  *      have already been handled (when value 1b1') or not yet handled (when value is 1b0').
  * @param   hBsec [in] : BSEC handle
  * @param   pFdisTkValue [in/out] : pointer to get value of bit OTP_DATA1.fdis_tk
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetFdisTkValue(BSEC_HandleTypeDef *hBsec, uint32_t *pFdisTkValue)
{
  HAL_StatusTypeDef status;
  uint32_t otpShadowReadVal = 0;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pFdisTkValue != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Read feature disabled from BSEC_OTP_DATA1 as always copied from SAFMEM for that word */
  /* BSEC Ready state is checked by second level function BSEC_OtpShadowRead() here     */
  status = HAL_BSEC_OtpShadowRead(hBsec, 1, (uint32_t *)&otpShadowReadVal);
  if (status == HAL_OK)
  {
    *pFdisTkValue = ((otpShadowReadVal & (1U << BSEC_OTP_CFG1_FDIS_TK_BIT_POS)) >> BSEC_OTP_CFG1_FDIS_TK_BIT_POS);
  }

  return (status);
}

/**
  * @brief   This function is used during ST Key Provisioning to read TK from 4 read
  *      in BSEC_SCRATCH register. This is only possible if OTP Mode = OTP_SECURE and
  *      fdis_tk = 0.
  *      The table to get the TK should be allocated externally to a size of 4 uint32_t
  * @param   hBsec [in] : BSEC handle
  * @param   tkValue [in/out] : pointer to get value TK
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetTk(BSEC_HandleTypeDef *hBsec, uint32_t *tkValue)
{
  uint32_t idx;
  HAL_StatusTypeDef status = HAL_TIMEOUT ;
  uint32_t *pReadPointer = &(tkValue[3]);  /* Initialize read pointer to
                                              key LSWord start position for the key retrieve */

  /*
   * Important Note :
   * If TK = AES 128 Key is 0x00112233445566778899AABBCCDDEEFF => will be used externally as uint8_t aes_key[16]
   * and called as BSEC_GetTk(hBsec, (uint32_t *) aes_key) : we expect to read :
   * aes_key[16] = { 0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF }
   * First read BSEC_SCRATCH will retrieve LSWord of Key -> 0xCCDDEEFF
   * Second read BSEC_SCRATCH will retrieve        -> 0x8899AABB
   * Third  read BSEC_SCRATCH will retrieve        -> 0x44556677
   * Fourth read BSEC_SCRATCH will retrieve        -> 0x00112233
   * Hence the implementation below :
   */

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (tkValue != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  for (idx = 0; idx < 4U; idx++)
  {
    /* Read BSEC_SCRATCH but do not care about eventual errors */
    status = HAL_BSEC_ReadScratch(hBsec, pReadPointer);

    pReadPointer--; /* decrement pReadPointer */
  }

  return (status);
}

/**
  * @brief   This function gets debug signals enabled/disabled status by reading BSEC register 'BSEC_DENABLE'.
  * @param   hBsec [in] : BSEC handle
  * @param   pDebugMaskEnabled [in/out] : pointer to get the mask of debug signals enabled/disabled.
  *                    Any bit value in mask set to 1b1' means a debug signal that is enabled,
  *                    while 1b0' bit in mask means a debug signal disabled
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetDebugEnabled(BSEC_HandleTypeDef *hBsec, uint32_t *pDebugMaskEnabled)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t validMask = ((1U << ((uint32_t)BSEC_DEBUG_ENABLE_MAX + 1U)) - 1U);

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pDebugMaskEnabled != (uint32_t *)NULL)),
                          BSECDRV,AssertBlocking); */

