zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_bsec.c
  /* The BSEC driver should be at least in ready state */
  if (hBsec->State >= BSEC_STATE_READY)
  {
    *pDebugMaskEnabled = ((hBsec->Instance->BSEC_DENABLE) & validMask);

    retVal = HAL_OK;
  }
  else
  {
    /* Error BSEC driver and hardware is not in ready state */
    /* Detail error */
    hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
  }

  return (retVal);
}

/**
  * @brief   This function set debug signals enabled/disabled mask by writing to write register 'BSEC_DENABLE'
  *      to an enable/disable mask value in second parameter.
  *      This is possible if the BSEC_DENABLE register is not currently sticky write locked.
  * @param   hBsec [in] : BSEC handle
  * @param   debugMaskEnabled [in/out] : Mask of disable/enable of debug signals.
  *                     Any value set to 1b1' means debug signal is enabled,
  *                     1b0' is a debug signal disabled
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_SetDebugEnabled(BSEC_HandleTypeDef *hBsec, uint32_t debugMaskEnabled)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  uint32_t validMask = ((1U << ((uint32_t)BSEC_DEBUG_ENABLE_MAX + 1U)) - 1U);

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  if (debugMaskEnabled <= validMask)
  {
    /* The BSEC driver should be at least in ready state */
    if (hBsec->State >= BSEC_STATE_READY)
    {
      /* Is debug enable function locked sticky ?               */
      /* Decision here to use direct register access instead of function call */
      /* BSEC_FunctionGetLock() which would take longer processing time     */
      if ((hBsec->Instance->BSEC_OTP_LOCK & BSEC_OTP_LOCK_DENREG) != 0U)
      {
        /* Yes the debug enable is sticky locked (write)       */
        /* Not possible to write currently the register BSEC_DENABLE */
        /* Update Error description */
        hBsec->Error |= (uint32_t)BSEC_ERROR_LOCK_WRITE;
      }
      else
      {
        /* BSEC_DENABLE is not sticky write locked : proceed to write BSEC_DENABLE */
        hBsec->Instance->BSEC_DENABLE = (debugMaskEnabled & validMask);
        retVal = HAL_OK;
      }
    }
    else
    {
      /* Error BSEC driver and hardware is not in ready state */
      /* Detail error */
      hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
    }
  }
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This function reads in *pPKH the public key HASH (SHA-256) from OTP_DATA[31:24]
  *      This is the hash by SHA-256 of the public key used for authentication of the First Stage Boot Loader (FSBL).
  * @param   hBsec [in] : BSEC handle
  * @param   readMode [in] : read mode should take value from @ref BSEC_ReadModeTypeDef.
  * @param   pkhOtpFirstWordIdx [in] : first OTP word index of PKH
  * @param   pPKH [in/out] : Pointer to read the public key (the memory should have been allocated externally).
  *
  * Note : prior the get an array of 32 bytes should have been allocated externally from this BSEC function, there
  *    is no static or dynamic memory allocation in the current function.
  *
  * @retval  HAL_StatusTypeDef : Returned value.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_GetPKH(BSEC_HandleTypeDef *hBsec,
                                  BSEC_ReadModeTypeDef readMode,
                                  uint32_t       pkhOtpFirstWordIdx,
                                  uint8_t     *pPKH)
{
  HAL_StatusTypeDef retVal = HAL_ERROR;
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t *pPubKeyHashWord;
  uint32_t otpWordIdx;

  /* Verify input parameters validity */
  /* INFASSERTS_REQUIRE(((hBsec != (BSEC_HandleTypeDef *)NULL) && (pPKH != (uint8_t *)NULL)),
                          BSECDRV,AssertBlocking); */

  /* Clean up first Error field in handle (used by previous calls to BSEC driver) */
  hBsec->Error = (uint32_t)BSEC_ERROR_NONE;

  if (pkhOtpFirstWordIdx <= BSEC_OTP_WORD_INDEX_MAX)
  {
    /* Initialize 'pPubKeyHashWord' */
    pPubKeyHashWord = (uint32_t *)pPKH;

    if (readMode == BSEC_READ_FROM_SHADOW)
    {
      /* The BSEC driver should be at least in ready state */
      if (hBsec->State >= BSEC_STATE_READY)
      {
        uint32_t temp = pkhOtpFirstWordIdx + 8U;
        for (otpWordIdx = pkhOtpFirstWordIdx; ((otpWordIdx < (temp)) && (status == HAL_OK)); otpWordIdx++)
        {
          status = HAL_BSEC_OtpShadowRead(hBsec, otpWordIdx, (uint32_t *)pPubKeyHashWord);
          pPubKeyHashWord++;
        }

        /* Return the status : which can be early exit case if issue occurred, in that case the contents */
        /* of *pPKH should not be trusted and used : hBsec->Error will have been updated by HAL_BSEC_OtpRead() or */
        /* BSEC_OtpShadowRead() function */
        retVal = status;
      }
      else
      {
        /* Error BSEC driver and hardware is not in ready state */
        /* Update Error description */
        hBsec->Error |= (uint32_t)BSEC_ERROR_DRIVER_NOT_READY;
      }

    } /* of if(readMode == BSEC_READ_FROM_SHADOW) */
    else
    {
      /* Read from SAFMEM ... */
      /* The BSEC driver should be at least in state SAFMEM Pwr Up */
      if (hBsec->State == BSEC_STATE_SAFMEM_PWRUP)
      {
        /* Force update of shadows from SAFMEM before reading from shadows                    */
        /* This takes longer time and assumes we do not trust at the point we read the OTP shadow registers values */
        uint32_t temp = pkhOtpFirstWordIdx + 8U;
        for (otpWordIdx = pkhOtpFirstWordIdx; ((otpWordIdx < (temp)) && (status == HAL_OK)); otpWordIdx++)
        {
          status = HAL_BSEC_OtpRead(hBsec, otpWordIdx, (uint32_t *)pPubKeyHashWord);
          pPubKeyHashWord++;
        }

        /* Return the status : which can be early exit case if issue occurred, in that case the contents */
        /* of *pPKH should not be trusted and used : hBsec->Error will have been updated by HAL_BSEC_OtpRead() or */
        /* BSEC_OtpShadowRead() function */
        retVal = status;
      }
      else
      {
        /* Error BSEC driver and hardware is not in SAFMEM Pwr Up */
        /* Update Error description */
        hBsec->Error |= (uint32_t)BSEC_ERROR_SAFMEM_PWRDOWN;
      }

    } /* of else Read from SAFMEM */

  } /* of if(pkhOtpFirstWordIdx <= BSEC_OTP_WORD_INDEX_MAX) */
  else
  {
    /* Update Error description to Invalid parameter */
    hBsec->Error = (uint32_t)BSEC_ERROR_INVALID_PARAMETER;
  }

  return (retVal);
}

/**
  * @brief   This static function implements simple integer division
  *      (A div B) and (A mod B) to obtain quotient in *pQ and remainder (modulo) in *pR.
  *
  * @param   A [in] : dividend
  * @param   B [in] : divider
  * @param   pQ [in/out] : integer quotient
  * @param   pR [in/out] : modulo
  * @retval  Void.
  ******************************************************************************
  */
void HAL_BSEC_Div(uint32_t A, uint32_t B, uint32_t *pQ, uint32_t *pR)
{
  uint32_t var1 = A;
  uint32_t var2 = 0;

  /* INFASSERTS_REQUIRE(((pQ != (uint32_t *)NULL) && (pR != (uint32_t *)NULL)),BSECDRV,AssertBlocking); */

  while (var1 >= B)
  {
    var1 = (var1 - B);
    var2++;
  }

  *pR = var1;
  *pQ = var2;
}

/**
  * @brief   This function wait until bit BSEC_OTP_CONTROL.BUSY is 1b0'
  *      before a timeout.
  * @param   hBsec [in] : BSEC handle
  *
  * @retval  timeoutDetected : value 0x1 if timeout was detected while
  *      waiting for bit BUSY to be cleared.
  ******************************************************************************
  */
uint32_t HAL_BSEC_WaitBusyClearWithTimeout(const BSEC_HandleTypeDef *hBsec)
{
  uint32_t timerValInit = HAL_GetTick();
  uint32_t timeoutDetected = 0;

  /* INFASSERTS_REQUIRE((hBsec != (BSEC_HandleTypeDef *)NULL),BSECDRV,AssertBlocking); */

  while (((hBsec->Instance->BSEC_OTP_STATUS & BSEC_OTP_STATUS_BUSY) != 0U) &&
         (timeoutDetected == 0U))
  {
    /* Sense timeout occurrence */
    if (((int32_t)HAL_GetTick() - (int32_t)timerValInit) >= BSEC_TIMEOUT_VAL)
    {
      timeoutDetected = 1;
    }

  } /* of while loop */

  return (timeoutDetected);
}

#endif /* HAL_BSEC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

